{
  "words": [
    {"word": "POO", "hint": "Programmation orientée objet, une méthode de codage et d'organisation."},
    {"word": "MODULARITE", "hint": "Principe de conception qui consiste à diviser un système en modules séparés."},
    {"word": "REUTILISABILITE", "hint": "Capacité de parties du code à être réutilisées dans différents projets."},
    {"word": "STRUCTURATION", "hint": "Organisation et agencement du code dans un projet informatique."},
    {"word": "CLASSE", "hint": "Modèle de données pour créer des objets avec des propriétés et méthodes spécifiques."},
    {"word": "METHODES", "hint": "Fonctions définies dans les classes pour effectuer des actions."},
    {"word": "CONSTRUCTEUR", "hint": "Méthode spéciale utilisée pour créer et initialiser un objet d'une classe."},
    {"word": "THIS", "hint": "Référence l'objet courant, utilisé pour accéder aux propriétés de l'objet."},
    {"word": "INSTANCIATION", "hint": "Processus de création d'une instance d'une classe."},
    {"word": "DONNEES", "hint": "Informations traitées ou stockées par un logiciel."},
    {"word": "HERITAGE", "hint": "Mécanisme par lequel une classe dérive des attributs et comportements d'une autre classe."},
    {"word": "SUPER", "hint": "Méthode utilisée dans les classes enfants pour appeler des méthodes d'une classe parente."},
    {"word": "ACCESSEURS", "hint": "Méthodes utilisées pour obtenir ou définir la valeur d'une propriété d'objet."},
    {"word": "GETTERS", "hint": "Méthodes pour récupérer la valeur d'une propriété."},
    {"word": "SETTERS", "hint": "Méthodes pour définir la valeur d'une propriété."},
    {"word": "COMPOSITION", "hint": "Technique pour combiner des objets simples ou des types de données en structures plus complexes."},
    {"word": "LOCALSTORAGE", "hint": "Objet de stockage web qui conserve des données sans date d'expiration."},
    {"word": "SESSIONSTORAGE", "hint": "Objet de stockage web qui conserve des données pour la durée d'une session et les efface à la fermeture de l'onglet."},
    {"word": "JSON", "hint": "Notation d'Objet JavaScript, format léger d'échange de données."},
    {"word": "TIMERS", "hint": "Outils pour exécuter du code à des intervalles de temps spécifiés."},
    {"word": "SETTIMEOUT", "hint": "Méthode pour exécuter une action après un délai déterminé."},
    {"word": "SETINTERVAL", "hint": "Méthode pour exécuter une action à des intervalles réguliers."},
    {"word": "CLEARTIMEOUT", "hint": "Méthode pour annuler l'exécution d'une action programmée avec setTimeout."},
    {"word": "CLEARINTERVAL", "hint": "Méthode pour arrêter les actions répétées définies par setInterval."},
    {"word": "REQUESTANIMATIONFRAME", "hint": "Méthode pour optimiser les animations en les synchronisant avec le rafraîchissement de l'écran."},
    {"word": "CANCELANIMATIONFRAME", "hint": "Méthode pour arrêter une animation programmée avec requestAnimationFrame."},
    {"word": "AJAX", "hint": "Technique de développement web pour créer des interactions dynamiques sur une page web."},
    {"word": "FETCH", "hint": "Méthode pour envoyer des requêtes HTTP et manipuler des promesses pour traiter la réponse."},
    {"word": "GET", "hint": "Méthode HTTP utilisée pour récupérer des données."},
    {"word": "POST", "hint": "Méthode HTTP utilisée pour envoyer des données à un serveur."},
    {"word": "ASYNC", "hint": "Mot-clé pour définir des fonctions asynchrones, permettant des opérations non bloquantes."},
    {"word": "AWAIT", "hint": "Mot-clé utilisé pour attendre la résolution d'une promesse dans une fonction async."},
    {"word": "CANVAS", "hint": "Élément HTML utilisé pour dessiner des graphiques via scripting."},
    {"word": "CONTEXT2D", "hint": "API pour dessiner sur le canvas en 2D."},
    {"word": "CALLBACK", "hint": "Fonction passée en argument à une autre fonction, appelée à l'exécution de cette dernière."},
    {"word": "PROPRIETE", "hint": "Attribut ou caractéristique associé à un objet."},
    {"word": "NAVIGATEUR", "hint": "Logiciel pour accéder et afficher des pages web."},
    {"word": "MODULARISATION", "hint": "Processus de division d'un programme en modules plus petits et gérables."},
    {"word": "VALEUR", "hint": "Information ou quantité qui peut être mesurée ou calculée."},
    {"word": "DELAI", "hint": "Période de temps avant qu'une action ne se produise."},
    {"word": "RAFRAICHISSEMENT", "hint": "Action de mettre à jour l'affichage d'une interface."},
    {"word": "SERVEUR", "hint": "Ordinateur ou programme qui fournit des données aux autres ordinateurs."},
    {"word": "REQUETE", "hint": "Demande d'informations ou d'actions envoyée à un système ou une application."},
    {"word": "REPONSE", "hint": "Informations renvoyées par un serveur en réponse à une requête."},
    {"word": "URL", "hint": "Adresse utilisée pour accéder à des ressources sur un réseau."},
    {"word": "SYNCHRONE", "hint": "Code qui s'exécute dans l'ordre où il apparaît dans le script."},
    {"word": "ASYNCHRONE", "hint": "Code qui peut s'exécuter indépendamment de l'ordre principal du programme."},
    {"word": "SYNTAXE", "hint": "Ensemble de règles définissant la structure du code dans un langage de programmation."}
   ]
}
